music_app/app/controllers/bands_controller.rb

    def create
        # debugger
        @band = Band.new(band_params)
        if @band.save!
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "sdfghjhgfdhjfhdgj"], ["created_at", "2019-02-28 20:42:18.930365"], ["updated_at", "2019-02-28 20:42:18.930365"]]